In [18]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('desafio1.csv')
#df = pd.read_csv('desafio1.csv', error_bad_lines = False)

In [3]:
df.head()

,RowNumber,id,sobrenome,pontuacao_credito,estado_residencia,genero,idade,nivel_estabilidade,saldo_conta,numero_produtos,possui_cartao_de_credito,membro_ativo
0,1,e7f44fcbd380d4cef7e6c232cc7e37895c3fd197,6d6e0aa1b9b413e442e2fb68df14b4fc3f91de50,619,SC,F,42,2,0.00,1,1,1
1,2,28dcb083ad90512da16b9430085c2cddb8ca5e12,48e1ad846796fa314f1b4a6702b83343eb5482c5,608,RS,F,41,1,83807.86,1,0,1
2,3,774bc378f787438c9c7594e536787d07a097a54b,f2b29d5d934de615812b697132e767dea0f1e9e2,502,SC,F,42,8,159660.80,3,1,0
3,4,043a71326f7096de155e7f0c559dc62b5e4b7239,85d5c9da7cddd8109ad32a6c348fe2bb10bf99f2,699,SC,F,39,1,0.00,2,0,0
4,5,37b3bb8ca243955fb3605ec7e1c2a4607cdb3b22,ddc89c837a6933639de75f28171057060bd322df,850,RS,F,43,2,125510.82,1,1,1

In [38]:
df.shape

(7000, 12)

In [15]:
df['estado_residencia'].unique()

array(['SC', 'RS', 'PR'], dtype=object)

In [4]:
aux = df[['estado_residencia','pontuacao_credito']]

In [5]:
aux.head()

  estado_residencia  pontuacao_credito
0                SC                619
1                RS                608
2                SC                502
3                SC                699
4                RS                850

In [39]:
aux.shape

(7000, 2)

In [10]:
#media
aux.groupby('estado_residencia')['pontuacao_credito'].mean()

estado_residencia
PR    648.961294
RS    651.105143
SC    649.537653
Name: pontuacao_credito, dtype: float64

In [16]:
#mediana
aux.groupby('estado_residencia')['pontuacao_credito'].median()

estado_residencia
PR    650
RS    650
SC    653
Name: pontuacao_credito, dtype: int64

In [26]:
grupo =  aux.groupby('estado_residencia')

In [44]:
grupo.count().sum()

pontuacao_credito    7000
dtype: int64

In [33]:
grupo.first()

                   pontuacao_credito
estado_residencia
PR                               376
RS                               608
SC                               619

In [29]:
#moda PR
grupo.get_group('PR').mode()

  estado_residencia  pontuacao_credito
0                PR                850

In [30]:
#moda RS
grupo.get_group('RS').mode()

  estado_residencia  pontuacao_credito
0                RS                850

In [31]:
#moda SC
grupo.get_group('SC').mode()

  estado_residencia  pontuacao_credito
0                SC                850

In [20]:
#testar moda com valor menor

0    850
dtype: int64

In [35]:
#desvio padrao  PR
grupo.get_group('PR').std()

pontuacao_credito    98.607186
dtype: float64

In [34]:
#desvio padrao  RS

grupo.get_group('RS').std()

pontuacao_credito    95.136598
dtype: float64

In [36]:
#desvio padrao  SC
grupo.get_group('SC').std()

pontuacao_credito    97.233493
dtype: float64

In [ ]:
{
    "SC": {"moda": 850, "mediana": 650, "media": 649.537653, "desvio_padrao": 97.233493},
    "RS": {"moda": 850, "mediana": 653, "media": 651.105143, "desvio_padrao": 95.136598},
    "PR": {"moda": 850, "mediana": 650, "media": 648.961294, "desvio_padrao": 98.607186}
}